<a href="https://colab.research.google.com/github/Praxis-QR/RDWH/blob/main/KK_A1_MySQL_Local_Shell_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![alt text](https://4.bp.blogspot.com/-gbL5nZDkpFQ/XScFYwoTEII/AAAAAAAAAGY/CcVb_HDLwvs2Brv5T4vSsUcz7O4r2Q79ACK4BGAYYCw/s1600/kk3-header00-beta.png)<br>


<hr>

[Prithwis Mukerjee](http://www.linkedin.com/in/prithwis)<br>

## Purpose
This Colab Notebook demonstrates how to 


1.   Install MySQL inside the VM
2.   Access MySQL from the mysql client
3.   Access MySQL from Python with Pandas 

<hr>
Last Updated : 20 Aug 2021

#Install & Test Connectivity

In [1]:
!apt-get update > null
!apt-get -y install mysql-server > null
!/etc/init.d/mysql restart

 * Stopping MySQL database server mysqld
   ...done.
 * Starting MySQL database server mysqld
No directory, logging in with HOME=/
   ...done.

In [2]:
!mysql --version
!mysql -e 'create database praxisDB'

mysql  Ver 14.14 Distrib 5.7.39, for Linux (x86_64) using  EditLine wrapper

In [3]:
!mysql -e 'show databases'

+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| praxisDB           |
| sys                |
+--------------------+

#Create Table & Load Data

### Test Data <br>

dept.csv https://drive.google.com/open?id=1rJu1oUgUsShEG9Hh8IG0-55tAisfYBCc

emp.csv https://drive.google.com/open?id=136ZpigRZKG3T-9wEBjD7r6P94y9gCWeU

In [4]:
# The CSV files are stored in the author's Google Drive
!gdown https://drive.google.com/uc?id=1rJu1oUgUsShEG9Hh8IG0-55tAisfYBCc
!gdown https://drive.google.com/uc?id=136ZpigRZKG3T-9wEBjD7r6P94y9gCWeU

Downloading...
From: https://drive.google.com/uc?id=1rJu1oUgUsShEG9Hh8IG0-55tAisfYBCc
To: /content/dept.csv
100% 148/148 [00:00<00:00, 229kB/s]
Downloading...
From: https://drive.google.com/uc?id=136ZpigRZKG3T-9wEBjD7r6P94y9gCWeU
To: /content/emp.csv
100% 734/734 [00:00<00:00, 1.25MB/s]

In [ ]:
!ls

dept.csv  emp.csv  null  sample_data

In [ ]:
!mysql praxisDB -e 'drop table empl'
!mysql praxisDB -e 'create table empl (empid char(6),lastname varchar(20), firstname varchar(20), jobdesc varchar(10), joindate date, salary int, comm decimal(3,2), deptid char(2));'
!mysql praxisDB -e 'drop table dept'
!mysql praxisDB -e 'create table dept (deptid char(2),deptname varchar(20), managerid char(6), location varchar(10));'

ERROR 1051 (42S02) at line 1: Unknown table 'praxisDB.empl'
ERROR 1051 (42S02) at line 1: Unknown table 'praxisDB.dept'

In [ ]:
!mysql praxisDB -e 'desc empl'

+-----------+--------------+------+-----+---------+-------+
| Field     | Type         | Null | Key | Default | Extra |
+-----------+--------------+------+-----+---------+-------+
| empid     | char(6)      | YES  |     | NULL    |       |
| lastname  | varchar(20)  | YES  |     | NULL    |       |
| firstname | varchar(20)  | YES  |     | NULL    |       |
| jobdesc   | varchar(10)  | YES  |     | NULL    |       |
| joindate  | date         | YES  |     | NULL    |       |
| salary    | int(11)      | YES  |     | NULL    |       |
| comm      | decimal(3,2) | YES  |     | NULL    |       |
| deptid    | char(2)      | YES  |     | NULL    |       |
+-----------+--------------+------+-----+---------+-------+

In [ ]:
!mysql praxisDB -e 'desc dept'

+-----------+-------------+------+-----+---------+-------+
| Field     | Type        | Null | Key | Default | Extra |
+-----------+-------------+------+-----+---------+-------+
| deptid    | char(2)     | YES  |     | NULL    |       |
| deptname  | varchar(20) | YES  |     | NULL    |       |
| managerid | char(6)     | YES  |     | NULL    |       |
| location  | varchar(10) | YES  |     | NULL    |       |
+-----------+-------------+------+-----+---------+-------+

In [ ]:
#quick SQL reference https://gist.github.com/hofmannsven/9164408
!mysql praxisDB -e "LOAD DATA LOCAL INFILE 'emp.csv' INTO TABLE empl FIELDS TERMINATED BY ',' IGNORE 1 LINES;"

In [ ]:
#!cat dept.csv
!mysql praxisDB -e "LOAD DATA LOCAL INFILE 'dept.csv' INTO TABLE dept FIELDS TERMINATED BY ',' LINES TERMINATED BY '\r\n'  IGNORE 1 LINES;"

#Retrieve Data

In [ ]:
!mysql praxisDB -e 'select * from empl'

+--------+-------------+-----------+------------+------------+--------+------+--------+
| empid  | lastname    | firstname | jobdesc    | joindate   | salary | comm | deptid |
+--------+-------------+-----------+------------+------------+--------+------+--------+
| 742866 | Bacchan     | Amitabh   | Executive  | 2003-03-10 |  50000 | 0.10 | 10     |
| 349870 | Mukherjee   | Rani      | Manager    | 2005-05-04 |  25000 | 0.06 | 40     |
| 865477 | Dikshit     | Madhuri   | Clerk      | 2002-04-04 |  10000 | 0.02 | 20     |
| 239456 | Khan        | Shahrukh  | Manager    | 2004-01-03 |  30000 | 0.07 | 20     |
| 897889 | Sehwag      | Virender  | Cus_Rep    | 2005-01-02 |  15000 | 0.05 | 20     |
| 123980 | Dhoni       | Mahender  | Clerk      | 2004-10-09 |   9000 | 0.02 | 40     |
| 822134 | Dravid      | Rahul     | Sr Manager | 2000-06-04 |  40000 | 0.08 | 30     |
| 997445 | Dalmia      | Jagmohan  | Clerk      | 2001-07-01 |  12000 | 0.02 | 30     |
| 989007 | Ganguly     | Sourav    | Cus_Rep    | 2002-01-01 |  20000 | 0.03 | 40     |
| 299034 | Ganesan     | Rekha     | Director   | 2002-10-10 |  60000 | 0.11 | 10     |
| 546223 | Karthikeyan | Narayan   | Secretary  | 2005-12-04 |  40000 | 0.09 | 10     |
| 223112 | Mirza       | Sania     | Cus_Rep    | 2001-11-19 |  25000 | 0.04 | 30     |
+--------+-------------+-----------+------------+------------+--------+------+--------+

In [ ]:
!mysql praxisDB -e 'select * from dept'

+--------+------------+-----------+----------+
| deptid | deptname   | managerid | location |
+--------+------------+-----------+----------+
| 10     | Corporate  | 299034    | Calcutta |
| 20     | Sales      | 239456    | Calcutta |
| 30     | Accounts   | 822134    | Calcutta |
| 40     | Production | 349870    | Bombay   |
+--------+------------+-----------+----------+

In [ ]:
!mysql praxisDB -e 'select lastname, firstname, location from empl, dept where empl.deptid = dept.deptid'

+-------------+-----------+----------+
| lastname    | firstname | location |
+-------------+-----------+----------+
| Bacchan     | Amitabh   | Calcutta |
| Mukherjee   | Rani      | Bombay   |
| Dikshit     | Madhuri   | Calcutta |
| Khan        | Shahrukh  | Calcutta |
| Sehwag      | Virender  | Calcutta |
| Dhoni       | Mahender  | Bombay   |
| Dravid      | Rahul     | Calcutta |
| Dalmia      | Jagmohan  | Calcutta |
| Ganguly     | Sourav    | Bombay   |
| Ganesan     | Rekha     | Calcutta |
| Karthikeyan | Narayan   | Calcutta |
| Mirza       | Sania     | Calcutta |
+-------------+-----------+----------+

#Python with Pandas

## Panda Modules

In [5]:
!apt install libmysqlclient-dev  > /dev/null
!pip install mysqlclient  > /dev/null
import pandas as pd
import MySQLdb

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

In [15]:
DBConn = MySQLdb.connect(db='praxisDB')
#df_mysql = pd.read_sql('select * from emp2;', con=con_mysql)  
df_mysql = pd.read_sql('show tables', con=DBConn)    
print ('loaded dataframe from MySQL. records:', len(df_mysql))
DBConn.close()

loaded dataframe from MySQL. records: 5

In [16]:
df_mysql

  Tables_in_praxisDB
0               dept
1              dept2
2               emp2
3               emp3
4               empl

## Pandas Functions

In [7]:
#To run any non-SELECT SQL command
def runCMD (DDL):
    DBConn= MySQLdb.connect(db='praxisDB')
    myCursor = DBConn.cursor()
    retcode = myCursor.execute(DDL) 
    print (retcode)
    DBConn.commit()
    DBConn.close()

#To run any SELECT SQL command
def runSELECT (CMD):
    DBConn= MySQLdb.connect(db='praxisDB')
    df_mysql = pd.read_sql(CMD, con=DBConn)    
    DBConn.close()
    return df_mysql

#Operations with Python

In [8]:
runCMD("DROP TABLE IF EXISTS empl;")
runCMD("CREATE TABLE IF NOT EXISTS empl ( \
  EmpID char(6)  NOT NULL, \
  LastName varchar(50) , \
  FirstName varchar(50) , \
  JobDesc varchar(50) , \
  JoinDate date NOT NULL, \
  Salary int(11) , \
  Comm float , \
  DeptID char(2) \
) ;")

0
0

In [9]:
runCMD("INSERT INTO empl (EmpID, LastName, FirstName, JobDesc, JoinDate, Salary, Comm, DeptID) \
    VALUES \
	('742866', 'Bacchan', 'Amitabh', 'Executive', '2003-03-10', 50000, 0.1, '10'), \
	('349870', 'Mukherjee', 'Rani', 'Manager', '2005-05-04', 25000, 0.06, '40'), \
	('865477', 'Dikshit', 'Madhuri', 'Clerk', '2002-04-04', 10000, 0.02, '20'), \
	('239456', 'Khan', 'Shahrukh', 'Manager', '2004-01-03', 30000, 0.07, '20'), \
	('897889', 'Sehwag', 'Virender', 'Cus_Rep', '2005-01-02', 15000, 0.05, '20'), \
	('123980', 'Dhoni', 'Mahender', 'Clerk', '2004-10-09', 9000, 0.02, '40'), \
	('822134', 'Dravid', 'Rahul', 'Sr Manager', '2000-06-04', 40000, 0.08, '30'), \
	('997445', 'Dalmia', 'Jagmohan', 'Clerk', '2001-07-01', 12000, 0.02, '30'), \
	('989007', 'Ganguly', 'Sourav', 'Cus_Rep', '2002-01-01', 20000, 0.03, '40'), \
	('299034', 'Ganesan', 'Rekha', 'Director', '2002-10-10', 60000, 0.11, '10'), \
	('546223', 'Karthikeyan', 'Narayan', 'Secretary', '2005-12-04', 40000, 0.09, '10'), \
	('223112', 'Mirza', 'Sania', 'Cus_Rep', '2001-11-19', 25000, 0.04, '30');"
    )

12

In [10]:
runCMD("DROP TABLE IF EXISTS dept;")
runCMD("CREATE TABLE dept ( \
  DeptID char(2)  NOT NULL, \
  DeptName varchar(50) , \
  ManagerID char(6) , \
  Location varchar(50) \
 );")

0
0

In [11]:
runCMD("INSERT INTO dept (DeptID, DeptName, ManagerID, Location) VALUES \
	('10', 'Corporate', '299034', 'Calcutta'), \
	('20', 'Sales', '239456', 'Calcutta'), \
	('30', 'Accounts', '822134', 'Calcutta'), \
	('40', 'Production', '349870', 'Bombay');")

4

In [12]:
runSELECT('Select * from empl;')

     EmpID     LastName FirstName     JobDesc    JoinDate  Salary  Comm DeptID
0   742866      Bacchan   Amitabh   Executive  2003-03-10   50000  0.10     10
1   349870    Mukherjee      Rani     Manager  2005-05-04   25000  0.06     40
2   865477      Dikshit   Madhuri       Clerk  2002-04-04   10000  0.02     20
3   239456         Khan  Shahrukh     Manager  2004-01-03   30000  0.07     20
4   897889       Sehwag  Virender     Cus_Rep  2005-01-02   15000  0.05     20
5   123980        Dhoni  Mahender       Clerk  2004-10-09    9000  0.02     40
6   822134       Dravid     Rahul  Sr Manager  2000-06-04   40000  0.08     30
7   997445       Dalmia  Jagmohan       Clerk  2001-07-01   12000  0.02     30
8   989007      Ganguly    Sourav     Cus_Rep  2002-01-01   20000  0.03     40
9   299034      Ganesan     Rekha    Director  2002-10-10   60000  0.11     10
10  546223  Karthikeyan   Narayan   Secretary  2005-12-04   40000  0.09     10
11  223112        Mirza     Sania     Cus_Rep  2001-11-19   25000  0.04     30

In [ ]:
runSELECT('Select * from dept;')

  DeptID    DeptName ManagerID  Location
0     10   Corporate    299034  Calcutta
1     20       Sales    239456  Calcutta
2     30    Accounts    822134  Calcutta
3     40  Production    349870    Bombay

In [ ]:
DBConn = MySQLdb.connect(db='praxisDB')
#df_mysql = pd.read_sql('select * from emp2;', con=con_mysql)  
pd.read_sql('show tables', con=DBConn)    
#print ('loaded dataframe from MySQL. records:', len(df_mysql))
#DBConn.close()

  Tables_in_praxisDB
0               dept
1               empl

#Modified  Tables

## Outer Join

In [13]:
runCMD("DROP TABLE IF EXISTS dept2;")
runCMD("CREATE TABLE dept2 ( \
  DeptID char(2)  NOT NULL, \
  DeptName varchar(50) , \
  ManagerID char(6) , \
  Location varchar(50) \
 );")
runCMD("INSERT INTO dept2 (DeptID, DeptName, ManagerID, Location) VALUES \
	('10', 'Corporate', '299034', 'Calcutta'), \
	('20', 'Sales', '239456', 'Calcutta'), \
	('30', 'Accounts', '822134', 'Calcutta'), \
	('70', 'Production', '349870', 'Bombay');")
# ----------------------------------------------------------------
runCMD("DROP TABLE IF EXISTS emp2;")
runCMD("CREATE TABLE IF NOT EXISTS emp2 ( \
  EmpID char(6)  NOT NULL, \
  LastName varchar(50) , \
  FirstName varchar(50) , \
  JobDesc varchar(50) , \
  JoinDate date NOT NULL, \
  Salary int(11) , \
  Comm float , \
  DeptID char(2) \
) ;")
runCMD("INSERT INTO emp2 (EmpID, LastName, FirstName, JobDesc, JoinDate, Salary, Comm, DeptID) VALUES \
	('742866', 'Bacchan', 'Amitabh', 'Executive', '2003-03-10', 50000, 0.10, '10'), \
	('349870', 'Mukherjee', 'Rani', 'Manager', '2005-05-04', 25000, 0.06, '40'), \
	('865477', 'Dikshit', 'Madhuri', 'Clerk', '2002-04-04', 10000, 0.02, '20'), \
	('239456', 'Khan', 'Shahrukh', 'Manager', '2004-01-03', 30000, 0.07, '20'), \
	('897889', 'Sehwag', 'Virender', 'Cus_Rep', '2005-01-02', 15000, 0.05, '20'), \
	('123980', 'Dhoni', 'Mahender', 'Clerk', '2004-10-09', 9000, 0.02, '40'), \
	('822134', 'Dravid', 'Rahul', 'Sr Manager', '2000-06-04', 40000, 0.08, '30'), \
	('997445', 'Dalmia', 'Jagmohan', 'Clerk', '2001-07-01', 12000, 0.02, '30'), \
	('989007', 'Ganguly', 'Sourav', 'Cus_Rep', '2002-01-01', 20000, 0.03, '40'), \
	('299034', 'Ganesan', 'Rekha', 'Director', '2002-10-10', 60000, 0.11, '10'), \
	('546223', 'Karthikeyan', 'Narayan', 'Secretary', '2005-12-04', 40000, 0.09, '50'), \
	('223112', 'Mirza', 'Sania', 'Cus_Rep', '2001-11-19', 25000, 0.04, '30');")

0
0
4
0
0
12

## Self Join

In [14]:
cmd = "DROP TABLE IF EXISTS `emp3`;"
runCMD(cmd)

cmd = "CREATE TABLE IF NOT EXISTS `emp3` ( \
  `EmpID` char(6) NOT NULL,\
  `LastName` varchar(11) DEFAULT NULL,\
  `FirstName` varchar(8) DEFAULT NULL,\
  `JobDesc` varchar(10) DEFAULT NULL,\
  `JoinDate` date DEFAULT NULL,\
  `Salary` int(5) DEFAULT NULL,\
  `Comm` decimal(3,2) DEFAULT NULL,\
  `DeptID` char(2) DEFAULT NULL,\
  `ManagerID` char(6) DEFAULT NULL\
) "

runCMD(cmd)

cmd = "INSERT INTO `emp3` (`EmpID`, `LastName`, `FirstName`, `JobDesc`, `JoinDate`, `Salary`, `Comm`, `DeptID`, `ManagerID`) VALUES \
	('742866', 'Bacchan', 'Amitabh', 'Executive', '2003-03-10', 50000, 0.10, '10', NULL), \
	('349870', 'Mukherjee', 'Rani', 'Manager', '2005-05-04', 25000, 0.06, '40', '742866'), \
	('865477', 'Dikshit', 'Madhuri', 'Clerk', '2002-04-04', 10000, 0.02, '20', '239456'), \
	('239456', 'Khan', 'Shahrukh', 'Manager', '2004-01-03', 30000, 0.07, '20', '742866'), \
	('897889', 'Sehwag', 'Virender', 'Cus_Rep', '2005-01-02', 15000, 0.05, '20', '239456'), \
	('123980', 'Dhoni', 'Mahender', 'Clerk', '2004-10-09', 9000, 0.02, '40', '349870'), \
	('822134', 'Dravid', 'Rahul', 'Sr Manager', '2000-06-04', 40000, 0.08, '30', '742866'), \
	('997445', 'Dalmia', 'Jagmohan', 'Clerk', '2001-07-01', 12000, 0.02, '30', '822134'), \
	('989007', 'Ganguly', 'Sourav', 'Cus_Rep', '2002-01-01', 20000, 0.03, '40', '299034'), \
	('299034', 'Ganesan', 'Rekha', 'Director', '2002-10-10', 60000, 0.11, '10', '742866'), \
	('546223', 'Karthikeyan', 'Narayan', 'Secretary', '2005-12-04', 40000, 0.09, '10', '299034'), \
	('223112', 'Mirza', 'Sania', 'Cus_Rep', '2001-11-19', 25000, 0.04, '30', '822134'); \
"
runCMD(cmd)

0
0
12

#Chronobooks <br>
![alt text](https://1.bp.blogspot.com/-lTiYBkU2qbU/X1er__fvnkI/AAAAAAAAjtE/GhDR3OEGJr4NG43fZPodrQD5kbxtnKebgCLcBGAsYHQ/s600/Footer2020-600x200.png)<hr>
Chronotantra and Chronoyantra are two science fiction novels that explore the collapse of human civilisation on Earth and then its rebirth and reincarnation both on Earth as well as on the distant worlds of Mars, Titan and Enceladus. But is it the human civilisation that is being reborn? Or is it some other sentience that is revealing itself. 
If you have an interest in AI and found this material useful, you may consider buying these novels, in paperback or kindle, from [http://bit.ly/chronobooks](http://bit.ly/chronobooks)